Revit 2027 API
DocumentWorksharingEnabledEventArgs.GetDocument Method
 Returns document associated with this event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
 The document associated with this event.
See Also
Reference
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace